<template>
  <div class="blue-form">
    <b-table striped :items="items" :fields="fields"></b-table>
  </div>
</template>

<script>
import api from '../api/api.js'

export default {
  name: 'CalendarPage',

  data() {
    return {
      fields: [
          { key: 'date', label: 'Дата' },
          { key: 'start', label: 'Начало' },
          { key: 'end', label: 'Конец' },
          { key: 'status', label: 'Статус' },
        ],

      items: [
        { date: '2019-05-17', start: '15:00', end: '15:30', status: 'Свободно'},
        { date: '2019-05-17', start: '15:30', end: '17:00', status: 'Иван Иванович Иванов'},
        { date: '2019-05-17', start: '18:00', end: '19:00', status: 'Свободно'},
        { date: '2019-05-17', start: '19:00', end: '20:00', status: 'Петр Петрович Петров'},
        { date: '2019-05-17', start: '20:00', end: '21:00', status: 'Свободно'},

        { date: '', start: '', end: '', status: '', _rowVariant: 'success'},

        { date: '2019-05-18', start: '15:00', end: '18:30', status: 'Свободно'},
        { date: '2019-05-18', start: '18:30', end: '19:00', status: 'Иван Иванович Иванов'},
        { date: '2019-05-18', start: '19:00', end: '21:00', status: 'Свободно'},

        { date: '', start: '', end: '', status: '', _rowVariant: 'success'},
        
        { date: '2019-05-19', start: '15:00', end: '16:00', status: 'Свободно'},
        { date: '2019-05-19', start: '16:00', end: '16:30', status: 'Иван Иванович Иванов'},
        { date: '2019-05-19', start: '16:30', end: '17:00', status: 'Петр Петрович Петров'},
        { date: '2019-05-19', start: '17:00', end: '19:30', status: 'Свободно'},
        { date: '2019-05-19', start: '19:30', end: '20:30', status: 'Иван Иванович Иванов'},
        { date: '2019-05-19', start: '20:30', end: '21:00', status: 'Свободно'},

        { date: '', start: '', end: '', status: '', _rowVariant: 'success'},

        { date: '2019-05-20', start: '15:00', end: '15:30', status: 'Свободно'},
        { date: '2019-05-20', start: '15:30', end: '17:00', status: 'Иван Иванович Иванов'},
        { date: '2019-05-20', start: '18:00', end: '19:00', status: 'Свободно'},
        { date: '2019-05-20', start: '19:00', end: '20:00', status: 'Петр Петрович Петров'},
        { date: '2019-05-20', start: '20:00', end: '21:00', status: 'Свободно'},

        { date: '', start: '', end: '', status: '', _rowVariant: 'success'},

        { date: '2019-05-21', start: '15:00', end: '17:00', status: 'Свободно'},
        { date: '2019-05-21', start: '17:00', end: '17:30', status: 'Петр Петрович Петров'},
        { date: '2019-05-21', start: '17:30', end: '18:30', status: 'Свободно'},
        { date: '2019-05-21', start: '18:30', end: '19:00', status: 'Иван Иванович Иванов'},
        { date: '2019-05-21', start: '19:00', end: '21:00', status: 'Свободно'},

        { date: '', start: '', end: '', status: '', _rowVariant: 'success'},
        
        { date: '2019-05-22', start: '15:00', end: '16:00', status: 'Свободно'},
        { date: '2019-05-22', start: '16:00', end: '16:30', status: 'Иван Иванович Иванов'},
        { date: '2019-05-22', start: '16:30', end: '17:00', status: 'Петр Петрович Петров'},
        { date: '2019-05-22', start: '17:00', end: '19:30', status: 'Свободно'},
        { date: '2019-05-22', start: '19:30', end: '20:30', status: 'Иван Иванович Иванов'},
        { date: '2019-05-22', start: '20:30', end: '21:00', status: 'Свободно'},
      ],


      fields1: [
          { key: 'time', label: 'Время' },
          { key: '0', label: 'Понедельник' },
          { key: '1', label: 'Вторник' },
          { key: '2', label: 'Среда' },
          { key: '3', label: 'Четверг' },
          { key: '4', label: 'Пятница' },
          { key: '5', label: 'Суббота' },
          { key: '6', label: 'Воскресенье' },
        ],

      items1: [
        { time: '07:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '07:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '08:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '08:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '09:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '09:30', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '10:00', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '10:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '11:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '11:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Иван Иванович Иванов', '6': 'Свободно' },
        { time: '12:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '12:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '13:00', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Иван Иванович Иванов', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '13:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '14:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '14:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '15:00', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '15:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '16:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Иван Иванович Иванов', '6': 'Свободно' },
        { time: '16:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '17:00', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '17:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '18:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Иван Иванович Иванов', '5': 'Свободно', '6': 'Свободно' },
        { time: '18:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '19:00', '0': 'Свободно', '1': 'Иван Иванович Иванов', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '19:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '20:00', '0': 'Свободно', '1': 'Свободно', '2': 'Иван Иванович Иванов', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '20:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '21:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '21:30', '0': 'Иван Иванович Иванов', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '22:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '22:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '23:00', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
        { time: '23:30', '0': 'Свободно', '1': 'Свободно', '2': 'Свободно', '3': 'Свободно', '4': 'Свободно', '5': 'Свободно', '6': 'Свободно' },
      ]
    }
  },

  computed: {
    c1() {

    }
  },
  
  created(){
    
  },

  methods: {
    m1() {

    }
  }
}
</script>